

vorposting:
1,3
4,2
2,3
1,7
4,8
7,8
9,3
7,10
10,9
8,10


10,9
8,9
9,2
1,8
2,1
1,3
7,1
3,4
4,7
4,5
5,6
6,4

=-========

[[1,3],[4,2],[2,3],[1,7],[4,8],[7,8],[9,3],[7,10],[10,9],[8,10]]


[[10,9],[8,9],[9,2],[1,8],[2,1],[1,3],[7,1],[3,4],[4,7],[4,5],[5,6],[6,4]]
[['10','9'],['8','9'],['9','2'],['1','8'],['2','1'],['1','3'],['7','1'],['3','4'],['4','7'],['4','5'],['5','6'],['6','4']]
[['10','9'],['8','9'],['9','2'],['1','8'],['2','1'],['1','3'],['7','1'],['3','4'],['4','7'],['4','5'],['5','6'],['6','4']]
[['1','2'],['3','2'],['2','9'],['9','10'],['10','3'],['10','8'],['4','10'],['8','7'],['7','4'],['7','6'],['6','5'],['5','7']]
1	10
2	9
3	8
4	7
5	6
6	5
7	4
8	3
9	2
10	1

ShittySI([[[['10','9'],['8','9'],['9','2'],['1','8'],['2','1'],['1','3'],['7','1'],['3','4'],['4','7'],['4','5'],['5','6'],['6','4']],[['1','2'],['3','2'],['2','9'],['9','10'],['10','3'],['10','8'],['4','10'],['8','7'],['7','4'],['7','6'],['6','5'],['5','7']]],"Auto","all"])



ShittySI([[[['1','3'],['4','2'],['2','3'],['1','7'],['4','8'],['7','8'],['9','3'],['7','10'],['10','9'],['8','10']],[['10','9'],['8','9'],['9','2'],['1','8'],['2','1'],['1','3'],['7','1'],['3','4'],['4','7'],['4','5'],['5','6'],['6','4']]],"Auto"])




[[['1','2'],['3','1']],[['4','4'],['5','5']]]
ShittySI([[[['1','2'],['3','1']],[['4','4'],['5','5']]],"Auto","all"])



[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]
{
'0': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\''], ['")\\\'\', [\'']], [['α1'], ['α1']]]], 
'1': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'2': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("bukDetect")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("bukDetect")\'', ['None', '']]]]]], 
'3': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print(""rasca;")\\\'\', [\'\', SyntaxError(\'invalid syntax\', (\'<string>\', 1, 13, \'print(""rasca;")\'))]]]\'', [['TOTAL_ARGUMENT == \'print(""rasca;")\'', ['', SyntaxError('invalid syntax', ('<string>', 1, 13, 'print(""rasca;")'))]]]]]], 
'4': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\''], ['")\\\'\', [\'']], [['α1'], ['α1']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [['rint('], ['rint(']], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [[", ['', "], [", ['', "]], [['α2'], ['α2']]]], 
'5': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'6': [[[['α0'], ['α0']], [["['"], ["['"]], [['the bloom that flies away'], ['the bloom that flies away']], [['α1'], ['α1']], [["']"], ["']"]], [['α2'], ['α2']]], [[['["[\''], ['["[\'']], [['α0'], ['α0']], [['\\\\n\']\\n"]'], ['\\\\n\']\\n"]']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [["']"], ["']"]], [['α1'], ['α1']]], [[['α0'], ['α0']], [['"[\''], ['"[\'']], [['α1'], ['α1']], [['\\\\n\']\\n"]'], ['\\\\n\']\\n"]']]], [[['["'], ['["']], [["['"], ["['"]], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['α0'], ['α0']], [[" \\'"], [" \\'"]], [['rint'], ['rint']], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [['rint('], ['rint(']], [['α2'], ['α2']]], [[["['"], ["['"]], [['α0'], ['α0']], [[" \\'"], [" \\'"]], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [[", ['"], [", ['"]], [['α2'], ['α2']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['α0'], ['α0']], [["['"], ["['"]], [['bukDetect'], ['bukDetect']], [['α1'], ['α1']], [["']"], ["']"]], [['α2'], ['α2']]], [[['α0'], ['α0']], [["['"], ["['"]], [['α1'], ['α1']], [['ect'], ['ect']], [['α2'], ['α2']], [['on'], ['on']], [['α3'], ['α3']]], [[['α0'], ['α0']], [["['"], ["['"]], [['xQc'], ['xQc']], [['α1'], ['α1']], [["']"], ["']"]], [['α2'], ['α2']]], [[['α0'], ['α0']], [["'rint"], ["'rint"]], [['α1'], ['α1']], [["' is not defined"], ["' is not defined"]], [['"'], ['"']], [['α2'], ['α2']]], [[['α0'], ['α0']], [['name '], ['name ']], [['α1'], ['α1']], [["' is not defined"], ["' is not defined"]], [['"'], ['"']], [['α2'], ['α2']]], [[['α0'], ['α0']], [["['"], ["['"]], [['UNLEASH FORCE'], ['UNLEASH FORCE']], [['α1'], ['α1']], [["']"], ["']"]], [['α2'], ['α2']]]], 
'7': [], 
'8': [[[['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [[", ['', SyntaxError('invalid syntax', ('<string>', 1, 1"], [", ['', SyntaxError('invalid syntax', ('<string>', 1, 1"]], [['α2'], ['α2']], [["'))]]]"], ["'))]]]"]]]], 
'9': [[[['α0'], ['α0']], [["['"], ["['"]], [['the bloom that flies away'], ['the bloom that flies away']], [['α1'], ['α1']], [["']"], ["']"]], [['α2'], ['α2']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [["']"], ["']"]], [['α1'], ['α1']]], [[['["[\''], ['["[\'']], [['α0'], ['α0']], [['\\\\n\']\\n"]'], ['\\\\n\']\\n"]']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [['li'], ['li']], [['α1'], ['α1']]], [[['α0'], ['α0']], [['"[\''], ['"[\'']], [['α1'], ['α1']], [['\\\\n\']\\n"]'], ['\\\\n\']\\n"]']]], [[['["'], ['["']], [["['"], ["['"]], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['α0'], ['α0']], [["['"], ["['"]], [['α1'], ['α1']], [['rin'], ['rin']], [['α2'], ['α2']], [[', '], [', ']], [['α3'], ['α3']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\''], ['")\\\'\', [\'']], [['α1'], ['α1']]], [[['α0'], ['α0']], [[" \\'"], [" \\'"]], [['rint'], ['rint']], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [['rint('], ['rint(']], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [[", ['"], [", ['"]], [['α2'], ['α2']]], [[["['"], ["['"]], [['α0'], ['α0']], [[" \\'"], [" \\'"]], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['α0'], ['α0']], [["['"], ["['"]], [['α1'], ['α1']], [['ect'], ['ect']], [['α2'], ['α2']], [['on'], ['on']], [['α3'], ['α3']]], [[['α0'], ['α0']], [['rror'], ['rror']], [['α1'], ['α1']], [['invalid syntax'], ['invalid syntax']], [['α2'], ['α2']], [['<string>'], ['<string>']], [['α3'], ['α3']]], [[['["'], ['["']], [['α0'], ['α0']], [['rror'], ['rror']], [[' is '], [' is ']], [['α1'], ['α1']]], [[['α0'], ['α0']], [["['"], ["['"]], [['α1'], ['α1']], [['rin'], ['rin']], [['α2'], ['α2']], [[')\\'], [')\\']], [['α3'], ['α3']]], [[["['"], ["['"]], [['α0'], ['α0']], [['rror'], ['rror']], [['α1'], ['α1']], [['rint'], ['rint']], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [[", ['', "], [", ['', "]], [['α2'], ['α2']]], [[["['"], ["['"]], [['α0'], ['α0']], [['rror'], ['rror']], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['['], ['[']], [["['"], ["['"]], [['α0'], ['α0']], [['i'], ['i']], [['α1'], ['α1']]], [[['α0'], ['α0']], [["'rint"], ["'rint"]], [['α1'], ['α1']], [["' is not defined"], ["' is not defined"]], [['"'], ['"']], [['α2'], ['α2']]], [[['α0'], ['α0']], [['["'], ['["']], [['α1'], ['α1']], [['rror'], ['rror']], [['α2'], ['α2']], [["', "], ["', "]], [['α3'], ['α3']]], [[['α0'], ['α0']], [['name '], ['name ']], [['α1'], ['α1']], [["' is not defined"], ["' is not defined"]], [['"'], ['"']], [['α2'], ['α2']]]], 
'10': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['α0'], ['α0']], [[" \\'"], [" \\'"]], [['rint'], ['rint']], [['α1'], ['α1']], [["', "], ["', "]], [['α2'], ['α2']]], [[['[['], ['[[']], [['α0'], ['α0']], [['TOTAL_ARGUMENT == '], ['TOTAL_ARGUMENT == ']], [['α1'], ['α1']], [['rint('], ['rint(']], [['α2'], ['α2']]], [[['α0'], ['α0']], [["'rint"], ["'rint"]], [['α1'], ['α1']], [["' is not defined"], ["' is not defined"]], [['"'], ['"']], [['α2'], ['α2']]]], 
'11': [], 
'12': []}

((critchancemod*critmultmod*(basedmgmod + basedmgmod*elementalstotal + basedmgmod*physicalbonusmod)) + ((1-critchancemod)(*basedmgmod + basedmgmod*elementalstotal + basedmgmod*physicalbonusmod)))*fireratemod


(
	(critchancemod*critmultmod*(basedmgmod + basedmgmod*elementalstotal + basedmgmod*physicalbonusmod)) + 
	((1-critchancemod)(*basedmgmod + basedmgmod*elementalstotal + basedmgmod*physicalbonusmod))
	)*fireratemod

TotalSI([[[['1', '0'], ['0', '1'], ['0', '2'], ['4', '0']], [['3', '0'], ['2', '1'], ['1', '2'], ['4', '0'], ['2', '2']]],"Auto"])


STEP 1: MAKE SI STRUCTURES

[['1','2'],['2','3'],['3','1'],['3','4']]

[['1b','2b'],['2b','3b'],['3b','1b']]

STEP 2: REPLACE EACH INTEGER WITH A FUNCTION

HINT: MAKE DIFFERENT BUT TOTALLY SI FUNCTIONS!


1: quine dot
[['single','single']]
[['loner','loner']]

2: line
[['oneway','oneway']]
[['unrequited','unrequited']]

3: triangle
[['A','B'],['B','C'],['C','A']]
[['z','y'],['y','x'],['x','z']]


4: square
[['art','gallery'],['gale','wind'],['gallery','gale'],['wind','art']]
[['tree','cow'],['bird','flight'],['cow','bird'],['flight','tree']]


:try to test the min function as well
[[[['single','single']],[['oneway','oneway']]],[[['oneway','oneway']],[['A','B'],['B','C'],['C','A']]],[[['A','B'],['B','C'],['C','A']],[['single','single']]],[[['A','B'],['B','C'],['C','A']],[['art','gallery'],['gale','wind'],['gallery','gale'],['wind','art']]]]

[['[[\'loner\',\'loner\']]','[[\'unrequited\',\'unrequited\']]'],['[[\'unrequited\',\'unrequited\']]','[[\'z\',\'y\'],[\'y\',\'x\'],[\'x\',\'z\']]'],['[[\'z\',\'y\'],[\'y\',\'x\'],[\'x\',\'z\']]','[[\'loner\',\'loner\']]']]
=================================================================================================

{
'0': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['?")\\\'\', [\'None\', \'\']]]'], ['?")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'1': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("fucking '], ['[[\'TOTAL_ARGUMENT == \\\'print("fucking ']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['?")\\\'\', [\'None\', \'\']]]'], ['?")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['s")\\\'\', [\'None\', \'\']]]'], ['s")\\\'\', [\'None\', \'\']]]']]]], 
'2': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("alive nine")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("alive nine")\'', ['None', '']]]]]], 
'3': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("fucking '], ['[[\'TOTAL_ARGUMENT == \\\'print("fucking ']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['?")\\\'\', [\'None\', \'\']]]'], ['?")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['s")\\\'\', [\'None\', \'\']]]'], ['s")\\\'\', [\'None\', \'\']]]']]]], 
'4': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("fucking '], ['[[\'TOTAL_ARGUMENT == \\\'print("fucking ']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'5': [[[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'6': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("alive nine")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("alive nine")\'', ['None', '']]]]]], 
'7': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("fucking '], ['[[\'TOTAL_ARGUMENT == \\\'print("fucking ']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("a'], ['[[\'TOTAL_ARGUMENT == \\\'print("a']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'8': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("alive nine")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("alive nine")\'', ['None', '']]]]]], 
'9': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'10': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'11': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("alive nine")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("alive nine")\'', ['None', '']]]]]], 
'12': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("alive nine")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("alive nine")\'', ['None', '']]]]]]
}















{
'0': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("fucking '], ['[[\'TOTAL_ARGUMENT == \\\'print("fucking ']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['?")\\\'\', [\'None\', \'\']]]'], ['?")\\\'\', [\'None\', \'\']]]']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['s")\\\'\', [\'None\', \'\']]]'], ['s")\\\'\', [\'None\', \'\']]]']]]], 
'1': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("fucking 0 degen answers")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("fucking 0 degen answers")\'', ['None', '']]]]]], 
'2': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'3': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['?")\\\'\', [\'None\', \'\']]]'], ['?")\\\'\', [\'None\', \'\']]]']]]], 
'4': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("what is suppans?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("what is suppans?")\'', ['None', '']]]]]], 
'5': [], 
'6': [], 
'7': [], 
'8': [], 
'9': [[[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]], 
'10': [],
'11': [[['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("beegees")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("beegees")\'', ['None', '']]]]]], 
'12': []
}




{
'0': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'1': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'2': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'3': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'4': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'5': [[[[['print("'], ['print("']], [['α0'], ['α0']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]], 
'6': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'7': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'8': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'9': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'10': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'11': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['")'], ['")']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]], 
'12': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'13': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'14': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'15': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'16': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'17': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['in'], ['in']], [['α1'], ['α1']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]], 
'18': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'19': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'20': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'21': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'22': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'23': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['on'], ['on']], [['α1'], ['α1']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]], 
'24': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'25': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'26': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'27': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'28': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'29': [[[[['print("'], ['print("']], [['α0'], ['α0']], [['ng '], ['ng ']], [['α1'], ['α1']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]], 
'30': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'31': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'32': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'33': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'34': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [[['[[\'TOTAL_ARGUMENT == \\\'print("'], ['[[\'TOTAL_ARGUMENT == \\\'print("']], [['α0'], ['α0']], [['")\\\'\', [\'None\', \'\']]]'], ['")\\\'\', [\'None\', \'\']]]']]]]], 
'35': [[[[['print("at what point does this take a long time?")'], ['print("at what point does this take a long time?")']]], [['TOTAL_ARGUMENT == \'[[\'TOTAL_ARGUMENT == \\\'print("at what point does this take a long time?")\\\'\', [\'None\', \'\']]]\'', [['TOTAL_ARGUMENT == \'print("at what point does this take a long time?")\'', ['None', '']]]]]]]}

